# Задание 3

n = input ("Введите число от 1 до 9: ")
print (int (n) + int (n + n) + int(n + n + n))